app/controllers/comments_controller.rb

  def index
    @post = Post.find(params[:id])
    @comments = Post.find(params[:id]).comments
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 10 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 8 LIMIT 1  [["id", 8], ["LIMIT", 1]]

  def edit
    @comment =Comment.find(params[:id])
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 25 LIMIT 1  [["id", 25], ["LIMIT", 1]]

  def create
    @comment = Comment.new(comment_params)
    @comment.post_id = params[:id]
    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`content`, `created_at`, `updated_at`, `post_id`) VALUES ('lo lalallalalala', '2020-03-26 21:07:44.554379', '2020-03-26 21:07:44.554379', 10)

  def update
    respond_to do |format|
      if @comment.update(comment_params,)
---
UPDATE `comments` SET `comments`.`content` = '888888', `comments`.`updated_at` = '2020-03-26 21:05:24.689544' WHERE `comments`.`id` = 25

  def destroy
    post_id=@comment.post_id
    @comment.destroy
---
DELETE FROM `comments` WHERE `comments`.`id` = 25