app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC
---
  def index
    @posts = Post.order(created_at: :desc)

INSERT INTO `posts` (`title`, `content`, `created_at`, `updated_at`) VALUES ('grading', 'gfdhcgjvkn', '2020-03-25 12:19:29.917661', '2020-03-25 12:19:29.917661')
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE `posts` SET `posts`.`title` = 'dfsdfabmnbn', `posts`.`updated_at` = '2020-03-26 17:57:02.438975' WHERE `posts`.`id` = 10
---
  def update
    respond_to do |format|
      if @post.update(post_params)